tutorials/fluids/immersedBoundary/translatingCylinderInChannel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| solids4foam: solid mechanics and fluid-solid interaction simulations        |
| Version:     v2.4                                                           |
| Web:         https://solids4foam.github.io                                  |
| Disclaimer:  This offering is not approved or endorsed by OpenCFD Limited,  |
|              producer and distributor of the OpenFOAM software via          |
|              www.openfoam.com, and owner of the OPENFOAM® and OpenCFD®      |
|              trade marks.                                                   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Schafer and Turek (1996) 2D-1 channel: [0, 2.2] x [0, 0.41] m. The immersed
// cylinder is not meshed: the mesh is uniform upstream of x = 1.2 m, over the
// path of the cylinder and its wake, and coarsens towards the outlet.
//
// The mesh density is set by the MESH_LEVEL environment variable (default 1),
// which halves the cell size for each level:
//     MESH_LEVEL=2 ./Allrun

MESH_LEVEL ${MESH_LEVEL:-1};

nRefine #eval "pow(2, $MESH_LEVEL - 1)";
nxUpstream #eval "round(120*$nRefine)";
nxDownstream #eval "round(35*$nRefine)";
ny #eval "round(41*$nRefine)";

convertToMeters 1;

vertices
(
    (0   0    0)
    (1.2 0    0)
    (2.2 0    0)
    (0   0.41 0)
    (1.2 0.41 0)
    (2.2 0.41 0)
    (0   0    0.1)
    (1.2 0    0.1)
    (2.2 0    0.1)
    (0   0.41 0.1)
    (1.2 0.41 0.1)
    (2.2 0.41 0.1)
);

blocks
(
    hex (0 1 4 3 6 7 10 9) ($nxUpstream $ny 1) simpleGrading (1 1 1)
    hex (1 2 5 4 7 8 11 10) ($nxDownstream $ny 1) simpleGrading (7 1 1)
);

boundary
(
    inlet
    {
        type            patch;
        faces           ((0 6 9 3));
    }
    outlet
    {
        type            patch;
        faces           ((2 5 11 8));
    }
    walls
    {
        type            wall;
        faces
        (
            (0 1 7 6)
            (1 2 8 7)
            (3 9 10 4)
            (4 10 11 5)
        );
    }
    frontAndBack
    {
        type            empty;
        faces
        (
            (0 3 4 1)
            (1 4 5 2)
            (6 7 10 9)
            (7 8 11 10)
        );
    }
);

// ************************************************************************* //
